samspencer5991/esp32-manager/Src/midi_handling.cpp
// Serial1
#if defined(USE_SERIAL1_MIDI) && !defined(USE_ESP_LINK)
void serial1Midi_ControlChangeCallback(uint8_t channel, uint8_t number, uint8_t value);
void serial1Midi_ProgramChangeCallback(uint8_t channel, uint8_t number);
void serial1Midi_SysexCallback(uint8_t * array, unsigned size);
#endif

#ifdef USE_ESP_LINK
void serial1Midi_ControlChangeCallback(uint8_t channel, uint8_t number, uint8_t value);
void serial1Midi_ProgramChangeCallback(uint8_t channel, uint8_t number);
void serial1Midi_SysexCallback(uint8_t * array, unsigned size);
#endif

// Serial2
#ifdef USE_SERIAL2_MIDI
void serial2Midi_ControlChangeCallback(uint8_t channel, uint8_t number, uint8_t value);
void serial2Midi_ProgramChangeCallback(uint8_t channel, uint8_t number);
void serial2Midi_SysexCallback(uint8_t * array, unsigned size);
#endif


//-------------- FreeRTOS Tasks --------------//
void midi_ProcessTask(void* parameter)
{
	//UBaseType_t uxHighWaterMark;
	while(1)
	{
		midi_ReadAll();
		//uxHighWaterMark = uxTaskGetStackHighWaterMark( NULL );
		//ESP_LOGD(TAG, "MIDI Process Task High Water Mark: %d", uxHighWaterMark);
		vTaskDelay(1);
	}
}

// RTOS Tasks
void midi_BleInfoTask(void* parameter)
{
	static uint16_t bleProcessCount = 0;
	//UBaseType_t uxHighWaterMark;
	while(1)
	{
		if(esp32ConfigPtr->wirelessType != Esp32BLE)
		{
			vTaskDelay(1000 / portTICK_PERIOD_MS);
			continue;
		}
		else
		{
			//uxHighWaterMark = uxTaskGetStackHighWaterMark( NULL );
			//ESP_LOGI(WIFI_TAG, "WiFi Process Task High Water Mark: %d", uxHighWaterMark);
			vTaskDelay(10 / portTICK_PERIOD_MS);
			bleProcessCount++;
			if(bleProcessCount >= 250)
			{
				//wifi_UpdateInfoTask();
				bleProcessCount = 0;
			}
		}
	}
}

//-------------- Global Function Definitions --------------//
void midi_Init()
{
	ESP_LOGD(TAG, "Wireless mode: %d", esp32ConfigPtr->wirelessType);
	ESP_LOGD(TAG, "BLE mode: %d", esp32ConfigPtr->bleMode);
	// General MIDI callback assignment
	// USBD
#ifdef USE_USBD_MIDI
	numMidiHandles++;
	usbdMidi.setHandleControlChange(usbdMidi_ControlChangeCallback);
	usbdMidi.setHandleProgramChange(usbdMidi_ProgramChangeCallback);
	usbdMidi.setHandleSystemExclusive(usbdMidi_SysexCallback);
#endif

	// USBH
#ifdef USE_USBH_MIDI
	numMidiHandles++;
	//midih_Init();
#endif

	// BLE
#ifdef USE_BLE_MIDI
	numMidiHandles++;
	// Server
	blueMidi.setHandleControlChange(blueMidi_ControlChangeCallback);
	blueMidi.setHandleProgramChange(blueMidi_ProgramChangeCallback);
	blueMidi.setHandleSystemExclusive(blueMidi_SysexCallback);

	BLEblueMidi.setHandleConnected(blueMidi_OnConnected);
	BLEblueMidi.setHandleDisconnected(blueMidi_OnDisconnected);

	// Client
#ifdef USE_BLE_MIDI_CLIENT
	BLEblueMidiClient.setHandleConnected([]()
		{
			Serial.println("---------CONNECTED---------");
		});

	BLEblueMidiClient.setHandleDisconnected([]()
		{
			Serial.println("---------NOT CONNECTED---------");
		});
#endif
#endif

	// WiFi RTP (Apple MIDI)
#ifdef USE_WIFI_RTP_MIDI
	numMidiHandles++;		
	RTP.setHandleConnected([](const APPLEMIDI_NAMESPACE::ssrc_t & ssrc, const char* name) {
    rtpIsConnected++;
	 //Serial.println("Connected to session");
    //Serial.printf("Connected to session %s %s", ssrc, name);
	 Serial.printf("Connected to session %s\n", name);
  });
  RTP.setHandleDisconnected([](const APPLEMIDI_NAMESPACE::ssrc_t & ssrc) {
    rtpIsConnected--;
    //Serial.printf("Disconnected %s", ssrc);
	 Serial.println("Disconnected from session");
  });

	rtpMidi.setHandleControlChange(rtpMidi_ControlChangeCallback);
	rtpMidi.setHandleProgramChange(rtpMidi_ProgramChangeCallback);
	rtpMidi.setHandleSystemExclusive(rtpMidi_SysexCallback);
#endif

	// Serial0
#ifdef USE_SERIAL0_MIDI
  	numMidiHandles++;
	serial0Midi.setHandleControlChange(serial0Midi_ControlChangeCallback);
	serial0Midi.setHandleProgramChange(serial0Midi_ProgramChangeCallback);
	serial0Midi.setHandleSystemExclusive(serial0Midi_SysexCallback);
#endif

	// Serial1
#if defined(USE_SERIAL1_MIDI) && !defined(USE_ESP_LINK)
	numMidiHandles++;		
	serial1Midi.setHandleControlChange(serial1Midi_ControlChangeCallback);
	serial1Midi.setHandleProgramChange(serial1Midi_ProgramChangeCallback);
	serial1Midi.setHandleSystemExclusive(serial1Midi_SysexCallback);
#endif

#ifdef USE_ESP_LINK
	serial1Midi.setHandleControlChange(serial1Midi_ControlChangeCallback);
	serial1Midi.setHandleProgramChange(serial1Midi_ProgramChangeCallback);
	serial1Midi.setHandleSystemExclusive(serial1Midi_SysexCallback);
#endif

	// Serial2
#ifdef USE_SERIAL2_MIDI
	numMidiHandles++;
	serial2Midi.setHandleControlChange(serial2Midi_ControlChangeCallback);
	serial2Midi.setHandleProgramChange(serial2Midi_ProgramChangeCallback);
	serial2Midi.setHandleSystemExclusive(serial2Midi_SysexCallback);
#endif



	// Begin MIDI interfaces
	// USBD
#ifdef USE_USBD_MIDI
  	ESP_LOGV(TAG, "Starting USBD MIDI");
	usbdMidi.begin(MIDI_CHANNEL_OMNI);
	usbdMidi.turnThruOff();
	if (TinyUSBDevice.mounted())
	{
		TinyUSBDevice.detach();
		delay(10);
		TinyUSBDevice.attach();
  	}
#endif
	// BLE
#ifdef USE_BLE_MIDI
	if(esp32ConfigPtr->wirelessType == Esp32BLE)
	{
		if(esp32ConfigPtr->bleMode == Esp32BLEServer)
		{
			ESP_LOGV(TAG, "Starting BLE MIDI Server");
			blueMidi.begin(MIDI_CHANNEL_OMNI);
		}
#ifdef USE_BLE_MIDI_CLIENT
		else if(esp32ConfigPtr->bleMode == Esp32BLEClient)
		{
			ESP_LOGV(TAG, "Starting BLE MIDI Central");
			blueMidiClient.begin(MIDI_CHANNEL_OMNI);
		}
#endif
		
	}
#endif
	// Serial0
#ifdef USE_SERIAL0_MIDI
	ESP_LOGV(TAG, "Starting Serial0 MIDI");
	serial0Midi.begin(MIDI_CHANNEL_OMNI);
#endif
	// Serial1
#if defined(USE_SERIAL1_MIDI) && !defined(USE_ESP_LINK)
	ESP_LOGV(TAG, "Starting Serial1 MIDI");
	serial1Midi.begin(MIDI_CHANNEL_OMNI);
#endif
// MIDI Bridge
#ifdef USE_ESP_LINK
	ESP_LOGV(TAG, "Starting MIDI Bridge on Serial1");
	serial1Midi.begin(MIDI_CHANNEL_OMNI);
	serial1Midi.turnThruOff();
#endif
	// Serial2
#ifdef USE_SERIAL2_MIDI
	ESP_LOGV(TAG, "Starting Serial2 MIDI");
	serial2Midi.begin(MIDI_CHANNEL_OMNI);
#endif

#if !defined(USE_ESP_LINK)
	midi_ApplyThruSettings();
#endif
}

