samspencer5991/esp32-manager/Src/midi_handling.cpp
void midi_ApplyThruSettings()
{
	// Apply MIDI thru settings
	// USBD
#ifdef USE_USBD_MIDI
	if(usbdMidiThruHandlesPtr != NULL)
	{
		if(usbdMidiThruHandlesPtr[MidiUSBD])
			usbdMidi.turnThruOn();
		else
			usbdMidi.turnThruOff();
	}
	else
	{
		usbdMidi.turnThruOff();
	}
#endif
	// USBH
#ifdef USE_USBH_MIDI	
	if(usbhMidiThruHandlesPtr != NULL)
	{
		if(usbhMidiThruHandlesPtr[MidiUSBH])
			usbhMidi.turnThruOn();
		else
			usbhMidi.turnThruOff();
	}
	else
	{
		usbhMidi.turnThruOff();
	}
#endif
	// BLE
#ifdef USE_BLE_MIDI
	if(bleMidiThruHandlesPtr != NULL)
	{
		if(bleMidiThruHandlesPtr[MidiBLE])
			blueMidi.turnThruOn();
		else
			blueMidi.turnThruOff();
	}
	else
	{
		blueMidi.turnThruOff();
	}
#endif
	// WiFi
#ifdef USE_WIFI_RTP_MIDI
	if(usbhMidiThruHandlesPtr != NULL)
	{
		if(wifiMidiThruHandlesPtr[MidiWiFiRTP])
			rtpMidi.turnThruOn();
		else
			rtpMidi.turnThruOff();
	}
	else
	{
		rtpMidi.turnThruOff();
	}
#endif
	// Serial0
#ifdef USE_SERIAL0_MIDI
	if(serial0MidiThruHandlesPtr != NULL)
	{
		if(serial0MidiThruHandlesPtr[MidiSerial0])
			serial0Midi.turnThruOn();
		else 
			serial0Midi.turnThruOff();
	}
	else
	{
		serial0Midi.turnThruOff();
	}
#endif
#ifdef USE_USE_ESP_LINK
	serial1Midi.turnThruOff();
#endif
	// Serial1
#ifdef USE_SERIAL1_MIDI
	if(serial0MidiThruHandlesPtr != NULL)
	{
		if(serial1MidiThruHandlesPtr[MidiSerial1])
			serial1Midi.turnThruOn();
		else
			serial1Midi.turnThruOff();
	}
	else
	{
		serial1Midi.turnThruOff();
	}
#endif
	// Serial2
#ifdef USE_SERIAL2_MIDI
	if(serial2MidiThruHandlesPtr != NULL)
	{
		if(serial2MidiThruHandlesPtr[MidiSerial2])
			serial2Midi.turnThruOn();
		else
			serial2Midi.turnThruOff();
	}
	else
	{
		serial2Midi.turnThruOff();
	}
#endif
}

// USBD MIDI must be initialised as soon as possible after boot
#ifdef USE_USBD_MIDI
void midi_InitUSBD()
{
	
}
#endif

// WiFi RTP must be initialised after WiFi is connected
#ifdef USE_WIFI_RTP_MIDI
void midi_InitWiFiRTP()
{
	if(esp32ConfigPtr->wirelessType != Esp32WiFi)
	{
		ESP_LOGI(TAG, "WiFi not enabled, cannot start RTP MIDI");
		return;
	}
	else
	{
		if(esp32Info.wifiConnected)
		{
			Serial.print("{\"debug\":{\"address\":\"");
			Serial.print(WiFi.localIP());
			Serial.print("\",\"port\":");
			Serial.print(RTP.getPort());
			Serial.print(",\"name\":\"");
			Serial.print(RTP.getName());
			Serial.print("\"}}~\n");
			rtpMidi.begin(MIDI_CHANNEL_OMNI);
		}
		else
		{
			//Serial.println("WiFi not connected, cannot start RTP MIDI");
		}
	}
}
#endif



void midi_ReadAll()
{
	// USBD
#ifdef USE_USBD_MIDI
	// Thru routing
	if(usbdMidi.read() && usbdMidiThruHandlesPtr != NULL)
	{
		midi_HandleThruRouting(usbdMidiThruHandlesPtr, usbdMidi.getType(), usbdMidi.getChannel(), usbdMidi.getData1(), usbdMidi.getData2());
#ifdef USE_ESP_LINK
		midi_LinkCreateDataPacket(MidiUSBD, usbdMidi.getType(), usbdMidi.getChannel(), usbdMidi.getData1(), usbdMidi.getData2());
#endif
	}
#endif
	// USBH
#ifdef USE_USBH_MIDI
	// Thru routing
	if(usbhMidi.read() && usbhMidiThruHandlesPtr != NULL)
	{
		midi_HandleThruRouting(usbhMidiThruHandlesPtr, usbhMidi.getType(), usbhMidi.getChannel(), usbhMidi.getData1(), usbhMidi.getData2());
#ifdef USE_ESP_LINK
		midi_LinkCreateDataPacket(MidiUSBH, usbhMidi.getType(), usbhMidi.getChannel(), usbhMidi.getData1(), usbhMidi.getData2());
#endif
	}
#endif

	// BLE
#ifdef USE_BLE_MIDI
	if(esp32ConfigPtr->wirelessType == Esp32BLE && !blockWirelessMidi)
	{
		if(esp32ConfigPtr->bleMode == Esp32BLEServer)
		{
			// Thru routing
			if(blueMidi.read() && bleMidiThruHandlesPtr != NULL)
			{
				midi_HandleThruRouting(bleMidiThruHandlesPtr, blueMidi.getType(), blueMidi.getChannel(), blueMidi.getData1(), blueMidi.getData2());
#ifdef USE_ESP_LINK
				midi_LinkCreateDataPacket(MidiBLE, blueMidi.getType(), blueMidi.getChannel(), blueMidi.getData1(), blueMidi.getData2());
#endif
			}
		}
#ifdef USE_BLE_MIDI_CLIENT
		else
		{
			// Thru routing
			if(blueMidiClient.read() && bleMidiThruHandlesPtr != NULL)
			{
				midi_HandleThruRouting(bleMidiThruHandlesPtr, blueMidiClient.getType(), blueMidiClient.getChannel(), blueMidiClient.getData1(), blueMidiClient.getData2());
#ifdef USE_ESP_LINK
				midi_LinkCreateDataPacket(MidiBLE, blueMidiClient.getType(), blueMidiClient.getChannel(), blueMidiClient.getData1(), blueMidiClient.getData2());
#endif
			}
		}
#endif
	
	}
#endif
	// WiFi RTP
#ifdef USE_WIFI_RTP_MIDI
	if(esp32ConfigPtr->wirelessType == Esp32WiFi && esp32Info.wifiConnected && !blockWirelessMidi)
	{
		// Thru routing
		if(rtpMidi.read() && wifiMidiThruHandlesPtr != NULL)
		{
			midi_HandleThruRouting(wifiMidiThruHandlesPtr, rtpMidi.getType(), rtpMidi.getChannel(), rtpMidi.getData1(), rtpMidi.getData2());
#ifdef USE_ESP_LINK
			midi_LinkCreateDataPacket(MidiWiFiRTP, rtpMidi.getType(), rtpMidi.getChannel(), rtpMidi.getData1(), rtpMidi.getData2());
#endif
		}
	
	}
#endif

	// Serial0
#ifdef USE_SERIAL0_MIDI
	// Thru routing
	if(serial0Midi.read() && serial0MidiThruHandlesPtr != NULL)
	{
		midi_HandleThruRouting(serial0MidiThruHandlesPtr, serial0Midi.getType(), serial0Midi.getChannel(), serial0Midi.getData1(), serial0Midi.getData2());
#ifdef USE_ESP_LINK
		midi_LinkCreateDataPacket(MidiSerial0, serial0Midi.getType(), serial0Midi.getChannel(), serial0Midi.getData1(), serial0Midi.getData2());
#endif
	}
#endif
	// Serial1
#if defined(USE_SERIAL1_MIDI) && !defined(USE_ESP_LINK)
	// Thru routing
	if(serial1Midi.read() && serial1MidiThruHandlesPtr != NULL)
	{
		midi_HandleThruRouting(serial1MidiThruHandlesPtr, serial1Midi.getType(), serial1Midi.getChannel(), serial1Midi.getData1(), serial1Midi.getData2());
	}
#endif
#ifdef USE_ESP_LINK
	serial1Midi.read();
#endif
	// Serial2
#ifdef USE_SERIAL2_MIDI
	// Thru routing
	if(serial2Midi.read() && serial2MidiThruHandlesPtr != NULL)
	{
		midi_HandleThruRouting(serial2MidiThruHandlesPtr, serial2Midi.getType(), serial2Midi.getChannel(), serial2Midi.getData1(), serial2Midi.getData2());
#ifdef USE_ESP_LINK
		midi_LinkCreateDataPacket(MidiSerial2, serial2Midi.getType(), serial2Midi.getChannel(), serial2Midi.getData1(), serial2Midi.getData2());
#endif
	}
#endif
}

void midi_HandleThruRouting(uint8_t* interfacePtr, MidiType type, Channel channel, DataByte data1, DataByte data2)
{
#ifdef USE_USBD_MIDI
	if(interfacePtr[MidiUSBD] == 1)
	{
		usbdMidi.send(type, channel, data1, data2);
	}
#endif
#ifdef USE_USBH_MIDI
	if(interfacePtr[MidiUSBH] == 1)
	{
		usbhMidi.send(type, channel, data1, data2);
	}
#endif
#ifdef USE_BLE_MIDI
	if(interfacePtr[MidiBLE] == 1)
	{
		blueMidi.send(type, channel, data1, data2);
	}
#endif
#ifdef USE_WIFI_RTP_MIDI
	if(interfacePtr[MidiWiFiRTP] == 1)
	{
		rtpMidi.send(type, channel, data1, data2);
	}
#endif
#ifdef USE_SERIAL0_MIDI
	if(interfacePtr[MidiSerial0] == 1)
	{
		serial0Midi.send(type, channel, data1, data2);
	}
#endif
#ifdef USE_SERIAL1_MIDI
	if(interfacePtr[MidiSerial1] == 1)
	{
		serial1Midi.send(type, channel, data1, data2);
	}
#endif
#ifdef USE_SERIAL2_MIDI
	if(interfacePtr[MidiSerial2] == 1)
	{
		serial2Midi.send(type, channel, data1, data2);
	}
#endif
}

// Global MIDI callback assignment functions
void midi_AssignControlChangeCallback(void (*callback)(MidiInterfaceType interface, uint8_t channel, uint8_t number, uint8_t value))
{
	mControlChangeCallback = callback;
}

void midi_AssignProgramChangeCallback(void (*callback)(MidiInterfaceType interface, uint8_t channel, uint8_t number))
{
	mProgramChangeCallback = callback;
}

void midi_AssignSysemExclusiveCallback(void (*callback)(MidiInterfaceType interface, uint8_t* array, unsigned size))
{
	mSystemExclusiveCallback = callback;
}

