samspencer5991/esp32-manager/Src/midi_handling.cpp
void midi_AssignPetalControlChangeCallback(void (*callback)(MidiInterfaceType interface, uint8_t channel, uint8_t number, uint8_t value))
{
	mPetalControlChangeCallback = callback;
}

void midi_AssignPetalProgramChangeCallback(void (*callback)(MidiInterfaceType interface, uint8_t channel, uint8_t number))
{
	mPetalProgramChangeCallback = callback;
}

void midi_AssignPetalSysemExclusiveCallback(void (*callback)(MidiInterfaceType interface, uint8_t* array, unsigned size))
{
	mPetalSystemExclusiveCallback = callback;
}

void midi_SendDeviceApiSysExString(const char* array, unsigned size, uint8_t containsFraming)
{
#ifdef USE_USBD_MIDI
	if(sysExLastReceptionType == MidiUSBD)
	{
		usbdMidi.sendSysEx(size, (uint8_t*)array, containsFraming);
		return;
	}
#endif

#ifdef USE_BLE_MIDI
	if(sysExLastReceptionType == MidiBLE)
	{
		blueMidi.sendSysEx(size, (uint8_t*)array, containsFraming);
		return;
	}
#endif

#ifdef USE_WIFI_RTP_MIDI
	else if(sysExLastReceptionType == MidiWiFiRTP)
	{
		const char testArray[] = {0xF0, 0x00, 0x22, 0x33, 0x01, 0x02, 0x03, 0x04, 0x05, 0xF7};
		rtpMidi.sendSysEx(10, (uint8_t*)testArray, 1);
		rtpMidi.sendSysEx(size, (uint8_t*)array, containsFraming);
		for(int i=0; i<size; i++)
		{
			Serial.printf("%02X ", array[i]);
		}
		Serial.println();
		//usbdMidi.sendSysEx(size, (uint8_t*)array, containsFraming);
	}
#endif
}

// Process SysEx data received on any interface.
void processSysEx(MidiInterfaceType interface, uint8_t* array, unsigned size)
{
	// If this is the first SysEx packet received in the reception
	if(array[0] == SYSEX_START)
	{
		// Check for a valid received address
		// Petal communication and Device API use a specific address
		// General SysEx and ESP Link messages do not require an address
		if(array[1] == SYSEX_ADDRESS_BYTE1 &&
			array[2] == SYSEX_ADDRESS_BYTE2 &&
			array[3] == SYSEX_ADDRESS_BYTE3)
		{
			receivedSysExAddress = 1;
			if(array[4] == SYSEX_DEVICE_API_COMMAND)
				sysExCommand = SysExDeviceApi;
			else if(array[4] == SYSEX_PETAL_COMMAND)
				sysExCommand = SysExPetal;
			else
				sysExCommand = SysExGeneral;

			// For non-general SysEx receptions
			if(sysExCommand != SysExGeneral)
			{
				sysExRxLock = interface;
				// Copy the received SysEx address to the buffer
				// The start/end, address, and command bytes are not copied
				memcpy(&sysExBuffer[0], &array[5], size-6);
				sysExBufferIndex = size-6;
			}
		}
#ifdef USE_ESP_LINK
		else if(array[1] >= ESP_LINK_DEVICE_INFO_HEADER && array[1] <= ESP_LINK_MIDI_DATA_HEADER)
		{
			sysExRxLock = MidiNone;
			sysExCommand = SysExEspLink;
		}
#endif
		else
		{
			sysExRxLock = MidiNone;
			sysExCommand = SysExGeneral;
		}
		if(array[size-1] == SYSEX_END)
		{
			sysExRxComplete = 1;
			sysExLastReceptionType = interface;
			sysExRxLock = MidiNone;
		}
	}
	// Continuation of existing reception
	else if(array[0] == SYSEX_END)
	{
		// For non-general SysEx receptions
		if(sysExCommand != SysExGeneral)
		{
			// Copy the received SysEx address to the buffer
			// The start/end, address, and command bytes are not copied
			memcpy(&sysExBuffer[sysExBufferIndex], &array[5], size-2);
			sysExBufferIndex += size-2;
		}
		if(array[size-1] == SYSEX_END)
		{
			sysExRxComplete = 1;
			sysExLastReceptionType = interface;
			sysExRxLock = MidiNone;
		}
	}
	if(sysExRxComplete)
	{
		Serial.printf("SysEx Complete with %d bytes with command type %d on port %d \n", sysExBufferIndex, sysExCommand, interface);
		if(sysExCommand == SysExDeviceApi)
		{
			deviceApi_Handler((char*)sysExBuffer, MIDI_TRANSPORT);
		}
		else if(sysExCommand == SysExPetal)
		{

		}
		else if(sysExCommand == SysExGeneral && mSystemExclusiveCallback != nullptr)
		{
			mSystemExclusiveCallback(MidiUSBD, sysExBuffer, sysExBufferIndex);
		}
#ifdef USE_ESP_LINK
		else if(sysExCommand == SysExEspLink)
		{
			midi_LinkProcessReceivedData(sysExBuffer, sysExBufferIndex);
		}
#endif
		sysExRxComplete = 0;
		sysExBufferIndex = 0;
		sysExRxLock = MidiNone;
		sysExCommand = SysExGeneral;
	}
}


//-------------- Petal Specific Functions --------------//
// These are typically called by the Petal execution
void midi_SendPetalSysEx(const uint8_t* data, size_t size)
{

}

void midi_SendPetalControlChange(uint8_t channel, uint8_t number, uint8_t value)
{

}

void midi_SendPetalProgramChange(uint8_t channel, uint8_t number)
{

}


//-------------- Transmit Functions --------------//
void midi_SendMessage(MidiInterfaceType interface, MidiType type, uint8_t channel, uint8_t data1, uint8_t data2)
{
#ifdef USE_USBD_MIDI
	if(interface == MidiUSBD)
		usbdMidi.send(type, data1, data2, channel);
#endif
#ifdef USE_USBH_MIDI
	if(interface == MidiUSBH)
		usbdMidi.send(type, data1, data2, channel);
#endif
#ifdef USE_BLE_MIDI
	if(interface == MidiBLE)
		usbdMidi.send(type, data1, data2, channel);
#endif
#ifdef USE_WIFI_RTP_MIDI
	if(interface == MidiWiFiRTP)
		usbdMidi.send(type, data1, data2, channel);
#endif
#ifdef USE_SERIAL0_MIDI
	if(interface == MidiSerial0)
		usbdMidi.send(type, data1, data2, channel);
#endif
#ifdef USE_SERIAL1_MIDI
	if(interface == MidiSerial1)
		usbdMidi.send(type, data1, data2, channel);
#endif
#ifdef USE_SERIAL2_MIDI
	if(interface == MidiSerial2)
		usbdMidi.send(type, data1, data2, channel);
#endif
}

void midi_SendControlChange(MidiInterfaceType interface, uint8_t channel, uint8_t number, uint8_t value)
{
#ifdef USE_USBD_MIDI
	if(interface == MidiUSBD)
		usbdMidi.sendControlChange(channel, number, value);
#endif
#ifdef USE_USBH_MIDI
	if(interface == MidiUSBH)
		usbhMidi.sendControlChange(channel, number, value);
#endif
#ifdef USE_BLE_MIDI
	if(interface == MidiBLE)
		blueMidi.sendControlChange(channel, number, value);
#endif
#ifdef USE_WIFI_RTP_MIDI
	if(interface == MidiWiFiRTP)
		rtpMidi.sendControlChange(channel, number, value);
#endif
#ifdef USE_SERIAL0_MIDI
	if(interface == MidiSerial0)
		serial0Midi.sendControlChange(channel, number, value);
#endif
#ifdef USE_SERIAL1_MIDI
	if(interface == MidiSerial1)
		serial1Midi.sendControlChange(channel, number, value);
#endif
#ifdef USE_SERIAL2_MIDI
	if(interface == MidiSerial2)
		serial2Midi.sendControlChange(channel, number, value);
#endif
}

