samspencer5991/esp32-manager/Src/midi_handling.cpp
void midi_SendSysEx(MidiInterfaceType interface, const uint8_t* array, unsigned size, uint8_t containsFraming)
{
#if defined(USE_SERIAL1_MIDI) || defined(USE_ESP_LINK)
	if(interface == MidiSerial1)
	{
		serial1Midi.sendSysEx(size, (uint8_t*)array, containsFraming);
		return;
	}
#endif
}


//-------------- MIDI Link Functions --------------//
#ifdef USE_ESP_LINK
void midi_LinkCreateDataPacket(MidiInterfaceType interface, midi::MidiType type, uint8_t channel, uint8_t data1, uint8_t data2)
{
	// Because of the unknown data length, SysEx messages are handled separately
	uint8_t data[3];
	uint8_t dataSize = 0;
	// Channel messages
	if(type <= midi::PitchBend)
	{
		data[0] = type | ((channel-1) & 0x0F);
		data[1] = data1;
		data[2] = data2;
		// 1 Data byte messages
		if(type == midi::ProgramChange || type == midi::AfterTouchChannel)
			dataSize = 2;

		// 2 Data byte messages
		else
			dataSize = 3;

	}
	// System Common messages
	else if(type != midi::SystemExclusive)
	{
		data[0] = type;
		data[1] = data1;
		data[2] = data2;

		// 2 Data byte messages
		if(type == midi::SongPosition)
			dataSize = 3;

		// 1 Data byte messages
		else if(type == midi::SongSelect || type == midi::TimeCodeQuarterFrame)
			dataSize = 2;

		else
			dataSize = 1;

	}
	midi_LinkTransmitDataPacket(interface, data, dataSize);
	
}

void midi_LinkTransmitDataPacket(MidiInterfaceType interface, uint8_t* data, uint16_t dataSize)
{
	uint8_t packetSize = 3 + dataSize; // 3 byte address, 1 byte header
	uint8_t packet[packetSize];
	packet[0] = ESP_LINK_MIDI_DATA_HEADER;		// Packet type

#ifdef USE_USBD_MIDI
	if(interface == MidiUSBD)
	{
		packet[1] = LINK_USBD_MIDI_ID;						// MIDI port
	}
#endif
#ifdef USE_USBH_MIDI
	if(interface == MidiUSBH)
	{
		packet[1] = LINK_USBH_MIDI_ID;						// MIDI port
	}
#endif
#ifdef USE_BLE_MIDI
	if(interface == MidiBLE)
	{
		packet[1] = LINK_BLE_MIDI_ID;
	}
#endif
#ifdef USE_WIFI_RTP_MIDI
	if(interface == MidiWiFiRTP)
	{
		packet[1] = LINK_WIFI_RTP_MIDI_ID;
	}
#endif
#ifdef USE__SERIAL0_MIDI
	if(interface == MidiSerial0)
	{
		packet[1] = LINK_SERIAL0_MIDI_ID;
	}
#endif
// Serial1 is always ESP Link
#ifdef USE__SERIAL2_MIDI
	if(interface == MidiSerial2)
	{
		packet[1] = LINK_SERIAL2_MIDI_ID;
	}
#endif
	packet[2] = dataSize;								// Number of data bytes
	for(uint16_t i=0; i<dataSize; i++)
	{
		packet[3+i] = data[i];
	}
	serial1Midi.sendSysEx(packetSize, packet, false);

}

void midi_LinkProcessReceivedData(uint8_t* data, uint16_t size)
{
	// Device info header

	// MIDI data packet
	if(data[0] == ESP_LINK_MIDI_DATA_HEADER)
	{

	}
}

#endif


//-------------- Handle Specific Functions --------------//
// USBD
#ifdef USE_USBD_MIDI
void usbdMidi_ControlChangeCallback(uint8_t channel, uint8_t number, uint8_t value)
{
	// Application specific callback
	if (mControlChangeCallback != nullptr)
	{
		mControlChangeCallback(MidiUSBD, channel, number, value);
	}
	//ESP_LOGI(TAG, "USBD MIDI CC: Ch: %d, Num: %d, Val: %d\n", channel, number, value);

}

void usbdMidi_ProgramChangeCallback(uint8_t channel, uint8_t number)
{
	if (mProgramChangeCallback != nullptr)
	{
		mProgramChangeCallback(MidiUSBD, channel, number);
	}
#if(CORE_DEBUG_LEVEL >= 4)
	Serial.printf("USBD MIDI PC: Ch: %d, Num: %d\n", channel, number);
#endif
}

void usbdMidi_SysexCallback(uint8_t * array, unsigned size)
{
	processSysEx(MidiUSBD, array, size);

	ESP_LOGI(TAG, "USBD MIDI SysEx: Size: %d\n", size);

}
#endif

// USBH
#ifdef USE_USBH_MIDI
void usbhMidi_ControlChangeCallback(uint8_t channel, uint8_t number, uint8_t value)
{
	if (mControlChangeCallback != nullptr)
	{
		mControlChangeCallback(MidiUSBH, channel, number, value);
	}
	ESP_LOGI(TAG, "USBH MIDI CC: Ch: %d, Num: %d, Val: %d\n", channel, number, value);
}

void usbhMidi_ProgramChangeCallback(uint8_t channel, uint8_t number)
{
	if (mProgramChangeCallback != nullptr)
	{
		mProgramChangeCallback(MidiUSBH, channel, number);
	}
	ESP_LOGI(TAG, "USBH MIDI PC: Ch: %d, Num: %d\n", channel, number);
}

void usbhMidi_SysexCallback(uint8_t * array, unsigned size)
{
	if (mSystemExclusiveCallback != nullptr)
	{
		mSystemExclusiveCallback(MidiUSBH, array, size);
	}
	ESP_LOGI(TAG, "USBH MIDI SysEx: Size: %d\n", size);

}
#endif

// BLE
#ifdef USE_BLE_MIDI
void blueMidi_ControlChangeCallback(uint8_t channel, uint8_t number, uint8_t value)
{
	if (mControlChangeCallback != nullptr)
	{
		mControlChangeCallback(MidiBLE, channel, number, value);
	}
	//ESP_LOGI(TAG, "BLE MIDI CC: Ch: %d, Num: %d, Val: %d\n", channel, number, value);
}

void blueMidi_ProgramChangeCallback(uint8_t channel, uint8_t number)
{
	if (mProgramChangeCallback != nullptr)
	{
		mProgramChangeCallback(MidiBLE, channel, number);
	}
	//ESP_LOGI(TAG, "BLE MIDI PC: Ch: %d, Num: %d\n", channel, number);
}

void blueMidi_SysexCallback(uint8_t * array, unsigned size)
{
	processSysEx(MidiBLE, array, size);
	if (mSystemExclusiveCallback != nullptr)
	{
		mSystemExclusiveCallback(MidiBLE, array, size);
	}
	//ESP_LOGI(TAG, "BLE MIDI SysEx: Size: %d\n", size);
}

void turnOnBLE()
{
	bleEnabled = 1;
	blueMidi.begin();
}

void turnOffBLE()
{
	bleEnabled = 0;
	//BLUEMIDI.end();
	NimBLEDevice::deinit(true);
}

void blueMidi_OnConnected()
{
	bleConnected = true;
	newBleEvent = 1;
	esp32Info.bleConnected = 1;
	ESP_LOGI(TAG, "BLE connected");
}

void blueMidi_OnDisconnected()
{
	bleConnected = false;
	newBleEvent = 1;
	esp32Info.bleConnected = 0;
	ESP_LOGI(TAG, "BLE disconnected");
}
#endif

// WiFi RTP
#ifdef USE_WIFI_RTP_MIDI
void rtpMidi_ControlChangeCallback(uint8_t channel, uint8_t number, uint8_t value)
{
	if (mControlChangeCallback != nullptr)
	{
		mControlChangeCallback(MidiWiFiRTP, channel, number, value);
	}
#if(CORE_DEBUG_LEVEL >= 4)
	Serial.printf("WiFi RTP MIDI CC: Ch: %d, Num: %d, Val: %d\n", channel, number, value);
#endif
}

void rtpMidi_ProgramChangeCallback(uint8_t channel, uint8_t number)
{
	if (mProgramChangeCallback != nullptr)
	{
		mProgramChangeCallback(MidiWiFiRTP, channel, number);
	}
#if(CORE_DEBUG_LEVEL >= 4)
	Serial.printf("WiFi RTP MIDI PC: Ch: %d, Num: %d\n", channel, number);
#endif
}

void rtpMidi_SysexCallback(uint8_t * array, unsigned size)
{
	processSysEx(MidiWiFiRTP, array, size);
	if (mSystemExclusiveCallback != nullptr)
	{
		mSystemExclusiveCallback(MidiWiFiRTP, array, size);
	}
#if(CORE_DEBUG_LEVEL >= 4)
	Serial.printf("WiFi RTP MIDI SysEx: Size: %d\n", size);
#endif
}
#endif

// Serial0
#ifdef USE_SERIAL0_MIDI
void serial0Midi_ControlChangeCallback(uint8_t channel, uint8_t number, uint8_t value)
{
	if (mControlChangeCallback != nullptr)
	{
		mControlChangeCallback(MidiSerial0, channel, number, value);
	}
#if(CORE_DEBUG_LEVEL >= 4)
	Serial.printf("Serial0 MIDI CC: Ch: %d, Num: %d, Val: %d\n", channel, number, value);
#endif
}

void serial0Midi_ProgramChangeCallback(uint8_t channel, uint8_t number)
{
	if (mProgramChangeCallback != nullptr)
	{
		mProgramChangeCallback(MidiSerial0, channel, number);
	}
#if(CORE_DEBUG_LEVEL >= 4)
	Serial.printf("Serial0 MIDI PC: Ch: %d, Num: %d\n", channel, number);
#endif
}

void serial0Midi_SysexCallback(uint8_t * array, unsigned size)
{
	if (mSystemExclusiveCallback != nullptr)
	{
		mSystemExclusiveCallback(MidiSerial0, array, size);
	}
#if(CORE_DEBUG_LEVEL >= 4)
	Serial.printf("Serial0 MIDI SysEx: Size: %d\n", size);
#endif
}
#endif

